jartieda/contiki/platform/stm32f4discovery/dcmi_ov2640.c
	/*
	 * PWDN PC8
	 * RST  PC7
	 */
	// GPIOD Periph clock enable
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);

	// Configure PD12, PD13, PD14 and PD15 in output pushpull mode
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	//power down
	GPIO_ResetBits(GPIOC, GPIO_Pin_8);
	//reset
	Delay(3);
	GPIO_SetBits(GPIOC, GPIO_Pin_7);
	Delay(3);
	GPIO_ResetBits(GPIOC, GPIO_Pin_7);
	Delay(3);
	GPIO_SetBits(GPIOC, GPIO_Pin_7);

	/****** Configures the I2C2 used for OV2640 camera module configuration *****/
	/* I2C2 clock enable */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2, ENABLE);

	/* GPIOB clock enable */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);

	/* Connect I2C2 pins to AF4 */
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_I2C2);
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_I2C2);

	/* Configure I2C2 GPIOs */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	/* Configure I2C2 */
	/* I2C DeInit */
	I2C_DeInit(I2C2);

	/* Enable the I2C peripheral */
	I2C_Cmd(I2C2, ENABLE);
	/* Set the I2C structure parameters */
	I2C_InitStruct.I2C_Mode = I2C_Mode_I2C;
	I2C_InitStruct.I2C_DutyCycle = I2C_DutyCycle_2;
	I2C_InitStruct.I2C_OwnAddress1 = 0xFE;
	I2C_InitStruct.I2C_Ack = I2C_Ack_Enable;
	I2C_InitStruct.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	I2C_InitStruct.I2C_ClockSpeed = 30000;

	/* Initialize the I2C peripheral w/ selected parameters */
	I2C_Init(I2C2, &I2C_InitStruct);

}

/**
 * @brief  Resets the OV2640 camera.
 * @param  None
 * @retval None
 */
void OV2640_Reset(void) {
	OV2640_WriteReg(OV2640_DSP_RA_DLMT, 0x01);
	OV2640_WriteReg(OV2640_SENSOR_COM7, 0x80);
}

/**
 * @brief  Reads the OV2640 Manufacturer identifier.
 * @param  OV2640ID: Pointer to the OV2640 Manufacturer identifier
 * @retval None
 */
void OV2640_ReadID(OV2640_IDTypeDef *OV2640ID) {
	OV2640_WriteReg(OV2640_DSP_RA_DLMT, 0x01);
	OV2640ID->Manufacturer_ID1 = OV2640_ReadReg(OV2640_SENSOR_MIDH);
	OV2640ID->Manufacturer_ID2 = OV2640_ReadReg(OV2640_SENSOR_MIDL);
	OV2640ID->PIDH = OV2640_ReadReg(OV2640_SENSOR_PIDH);
	OV2640ID->PIDL = OV2640_ReadReg(OV2640_SENSOR_PIDL);
}

/**
 * @brief  Configures DCMI/DMA to capture image from the OV2640 camera.
 * @param  ImageFormat: Image format BMP or JPEG
 * @param  BMPImageSize: BMP Image size
 * @retval None
 */
void OV2640_Init(ImageFormat_TypeDef ImageFormat) {
	DCMI_InitTypeDef DCMI_InitStructure;
	DMA_InitTypeDef DMA_InitStructure;

	/*** Configures the DCMI to interface with the OV2640 camera module ***/
	/* Enable DCMI clock */
	RCC_AHB2PeriphClockCmd(RCC_AHB2Periph_DCMI, ENABLE);

	/* DCMI configuration */
	DCMI_InitStructure.DCMI_CaptureMode = DCMI_CaptureMode_Continuous;
	DCMI_InitStructure.DCMI_SynchroMode = DCMI_SynchroMode_Hardware;
	DCMI_InitStructure.DCMI_PCKPolarity = DCMI_PCKPolarity_Rising;
	DCMI_InitStructure.DCMI_VSPolarity = DCMI_VSPolarity_Low;
	DCMI_InitStructure.DCMI_HSPolarity = DCMI_HSPolarity_Low;
	DCMI_InitStructure.DCMI_CaptureRate = DCMI_CaptureRate_1of4_Frame;
	DCMI_InitStructure.DCMI_ExtendedDataMode = DCMI_ExtendedDataMode_8b;

	/* Configures the DMA2 to transfer Data from DCMI */
	/* Enable DMA2 clock */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);

	/* DMA2 Stream1 Configuration */
	DMA_DeInit(DMA2_Stream1);

	DMA_InitStructure.DMA_Channel = DMA_Channel_1;
	DMA_InitStructure.DMA_PeripheralBaseAddr = DCMI_DR_ADDRESS;
	DMA_InitStructure.DMA_Memory0BaseAddr =  (uint32_t)frame_buffer;
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
	DMA_InitStructure.DMA_BufferSize = 120*80;//120*160/2
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;//DMA_Mode_Circular;
	DMA_InitStructure.DMA_Priority = DMA_Priority_High;
	DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;
	DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
	DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
	DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;

	switch (ImageFormat) {
	case BMP_QQVGA: {
		/* DCMI configuration */
		DCMI_InitStructure.DCMI_VSPolarity = DCMI_VSPolarity_High;
		DCMI_Init(&DCMI_InitStructure);

		/* DMA2 IRQ channel Configuration */
		DMA_Init(DMA2_Stream1, &DMA_InitStructure);
		break;
	}
	case BMP_QVGA: {
		/* DCMI configuration */
		DCMI_Init(&DCMI_InitStructure);

		/* DMA2 IRQ channel Configuration */
		DMA_Init(DMA2_Stream1, &DMA_InitStructure);
		break;
	}
	default: {
		/* DCMI configuration */
		DCMI_InitStructure.DCMI_VSPolarity = DCMI_VSPolarity_High;
		DCMI_Init(&DCMI_InitStructure);

		/* DMA2 IRQ channel Configuration */
		DMA_Init(DMA2_Stream1, &DMA_InitStructure);
		break;
	}
	}
	DCMI_ITConfig(DCMI_IT_FRAME, ENABLE);
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = DCMI_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

}

/**
 * @brief  Configures the OV2640 camera in QQVGA mode.
 * @param  None
 * @retval None
 */
void OV2640_QQVGAConfig(void) {
	uint32_t i;

	OV2640_Reset();
	Delay(200);

	/* Initialize OV2640 */
	for (i = 0; i < (sizeof(OV2640_QQVGA) / 2); i++) {
		OV2640_WriteReg(OV2640_QQVGA[i][0], OV2640_QQVGA[i][1]);
		Delay(2);
	}
}

/**
 * @brief  Configures the OV2640 camera in QVGA mode.
 * @param  None
 * @retval None
 */
void OV2640_QVGAConfig(void) {
	uint32_t i;

	OV2640_Reset();
	Delay(200);

	/* Initialize OV2640 */
	for (i = 0; i < (sizeof(OV2640_QVGA) / 2); i++) {
		OV2640_WriteReg(OV2640_QVGA[i][0], OV2640_QVGA[i][1]);
		Delay(2);
	}
}

/**
 * @brief  Configures the OV2640 camera in JPEG mode.
 * @param  JPEGImageSize: JPEG image size
 * @retval None
 */
void OV2640_JPEGConfig(ImageFormat_TypeDef ImageFormat) {
	uint32_t i;

	OV2640_Reset();
	Delay(200);

	/* Initialize OV2640 */
	for (i = 0; i < (sizeof(OV2640_JPEG_INIT) / 2); i++) {
		OV2640_WriteReg(OV2640_JPEG_INIT[i][0], OV2640_JPEG_INIT[i][1]);
	}

	/* Set to output YUV422 */
	for (i = 0; i < (sizeof(OV2640_YUV422) / 2); i++) {
		OV2640_WriteReg(OV2640_YUV422[i][0], OV2640_YUV422[i][1]);
	}

	OV2640_WriteReg(0xff, 0x01);
	OV2640_WriteReg(0x15, 0x00);

	/* Set to output JPEG */
	for (i = 0; i < (sizeof(OV2640_JPEG) / 2); i++) {
		OV2640_WriteReg(OV2640_JPEG[i][0], OV2640_JPEG[i][1]);
	}

	Delay(100);

	switch (ImageFormat) {
	case JPEG_160x120: {
		for (i = 0; i < (sizeof(OV2640_160x120_JPEG) / 2); i++) {
			OV2640_WriteReg(OV2640_160x120_JPEG[i][0],
					OV2640_160x120_JPEG[i][1]);
		}
		break;
	}
	case JPEG_176x144: {
		for (i = 0; i < (sizeof(OV2640_176x144_JPEG) / 2); i++) {
			OV2640_WriteReg(OV2640_176x144_JPEG[i][0],
					OV2640_176x144_JPEG[i][1]);
		}
		break;
	}
	case JPEG_320x240: {
		for (i = 0; i < (sizeof(OV2640_320x240_JPEG) / 2); i++) {
			OV2640_WriteReg(OV2640_320x240_JPEG[i][0],
					OV2640_320x240_JPEG[i][1]);
		}
		break;
	}
	case JPEG_352x288: {
		for (i = 0; i < (sizeof(OV2640_352x288_JPEG) / 2); i++) {
			OV2640_WriteReg(OV2640_352x288_JPEG[i][0],
					OV2640_352x288_JPEG[i][1]);
		}
		break;
	}
	default: {
		for (i = 0; i < (sizeof(OV2640_160x120_JPEG) / 2); i++) {
			OV2640_WriteReg(OV2640_160x120_JPEG[i][0],
					OV2640_160x120_JPEG[i][1]);
		}
		break;
	}
	}
}

/**
 * @brief  Configures the OV2640 camera brightness.
 * @param  Brightness: Brightness value, where Brightness can be:
 *         0x40 for Brightness +2,
 *         0x30 for Brightness +1,
 *         0x20 for Brightness 0,
 *         0x10 for Brightness -1,
 *         0x00 for Brightness -2,
 * @retval None
 */
void OV2640_BrightnessConfig(uint8_t Brightness) {
	OV2640_WriteReg(0xff, 0x00);
	OV2640_WriteReg(0x7c, 0x00);
	OV2640_WriteReg(0x7d, 0x04);
	OV2640_WriteReg(0x7c, 0x09);
	OV2640_WriteReg(0x7d, Brightness);
	OV2640_WriteReg(0x7d, 0x00);
}

/**
 * @brief  Configures the OV2640 camera Black and white mode.
 * @param  BlackWhite: BlackWhite value, where BlackWhite can be:
 *         0x18 for B&W,
 *         0x40 for Negative,
 *         0x58 for B&W negative,
 *         0x00 for Normal,
 * @retval None
 */
void OV2640_BandWConfig(uint8_t BlackWhite) {
	OV2640_WriteReg(0xff, 0x00);
	OV2640_WriteReg(0x7c, 0x00);
	OV2640_WriteReg(0x7d, BlackWhite);
	OV2640_WriteReg(0x7c, 0x05);
	OV2640_WriteReg(0x7d, 0x80);
	OV2640_WriteReg(0x7d, 0x80);
}

/**
 * @brief  Configures the OV2640 camera color effects.
 * @param  value1: Color effects value1
 * @param  value2: Color effects value2
 *         where value1 and value2 can be:
 *         value1 = 0x40, value2 = 0xa6 for Antique,
 *         value1 = 0xa0, value2 = 0x40 for Bluish,
 *         value1 = 0x40, value2 = 0x40 for Greenish,
 *         value1 = 0x40, value2 = 0xc0 for Reddish,
 * @retval None
 */
void OV2640_ColorEffectsConfig(uint8_t value1, uint8_t value2) {
	OV2640_WriteReg(0xff, 0x00);
	OV2640_WriteReg(0x7c, 0x00);
	OV2640_WriteReg(0x7d, 0x18);
	OV2640_WriteReg(0x7c, 0x05);
	OV2640_WriteReg(0x7d, value1);
	OV2640_WriteReg(0x7d, value2);
}

/**
 * @brief  Configures the OV2640 camera contrast.
 * @param  value1: Contrast value1
 * @param  value2: Contrast value2
 *         where value1 and value2 can be:
 *         value1 = 0x28, value2 = 0x0c for Contrast +2,
 *         value1 = 0x24, value2 = 0x16 for Contrast +1,
 *         value1 = 0x20, value2 = 0x20 for Contrast 0,
 *         value1 = 0x1c, value2 = 0x2a for Contrast -1,
 *         value1 = 0x18, value2 = 0x34 for Contrast -2,
 * @retval None
 */
void OV2640_ContrastConfig(uint8_t value1, uint8_t value2) {
	OV2640_WriteReg(0xff, 0x00);
	OV2640_WriteReg(0x7c, 0x00);
	OV2640_WriteReg(0x7d, 0x04);
	OV2640_WriteReg(0x7c, 0x07);
	OV2640_WriteReg(0x7d, 0x20);
	OV2640_WriteReg(0x7d, value1);
	OV2640_WriteReg(0x7d, value2);
	OV2640_WriteReg(0x7d, 0x06);
}

/**
 * @brief  Writes a byte at a specific Camera register
 * @param  Addr: OV2640 register address.
 * @param  Data: Data to be written to the specific register
 * @retval 0x00 if write operation is OK.
 *       0xFF if timeout condition occured (device not connected or bus error).
 */
uint8_t OV2640_WriteReg(uint16_t Addr, uint8_t Data) {
	uint32_t timeout = DCMI_TIMEOUT_MAX;

	/* Generate the Start Condition */
	I2C_GenerateSTART(I2C2, ENABLE);

	/* Test on I2C2 EV5 and clear it */
	timeout = DCMI_TIMEOUT_MAX; /* Initialize timeout value */
	while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT)) {
		/* If the timeout delay is exeeded, exit with error code */
		if ((timeout--) == 0) {
			//I2C_SoftwareResetCmd(I2C2, ENABLE);
			return 0xFF;
		}
	}

	/* Send DCMI selcted device slave Address for write */
	I2C_Send7bitAddress(I2C2, OV2640_DEVICE_WRITE_ADDRESS,
			I2C_Direction_Transmitter);

	/* Test on I2C2 EV6 and clear it */
	timeout = DCMI_TIMEOUT_MAX; /* Initialize timeout value */
	while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED)) {
		/* If the timeout delay is exeeded, exit with error code */
		if ((timeout--) == 0) {
			//return 0xFF;
			break;
		}
	}

	/* Send I2C2 location address LSB */
	I2C_SendData(I2C2, (uint8_t) (Addr));

	/* Test on I2C2 EV8 and clear it */
	timeout = DCMI_TIMEOUT_MAX; /* Initialize timeout value */
	while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED)) {
		/* If the timeout delay is exeeded, exit with error code */
		if ((timeout--) == 0)
			break;						//return 0xFF;
	}

