jartieda/contiki/platform/stm32f4discovery/dcmi_ov2640.c
	/* Send Data */
	I2C_SendData(I2C2, Data);

	/* Test on I2C2 EV8 and clear it */
	timeout = DCMI_TIMEOUT_MAX; /* Initialize timeout value */
	while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED)) {
		/* If the timeout delay is exeeded, exit with error code */
		if ((timeout--) == 0)
			break;//return 0xFF;
	}

	/* Send I2C2 STOP Condition */
	I2C_GenerateSTOP(I2C2, ENABLE);

	/* If operation is OK, return 0 */
	return 0;
}

/**
 * @brief  Reads a byte from a specific Camera register
 * @param  Addr: OV2640 register address.
 * @retval data read from the specific register or 0xFF if timeout condition
 *         occured.
 */
uint8_t OV2640_ReadReg(uint16_t Addr) {
	uint32_t timeout = DCMI_TIMEOUT_MAX;
	uint8_t Data = 0;

	/* Generate the Start Condition */
	I2C_GenerateSTART(I2C2, ENABLE);

	/* Test on I2C2 EV5 and clear it */
	timeout = DCMI_TIMEOUT_MAX; /* Initialize timeout value */
	while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT)) {
		/* If the timeout delay is exeeded, exit with error code */
		if ((timeout--) == 0)
			return 0xFF;
	}

	/* Send DCMI selcted device slave Address for write */
	I2C_Send7bitAddress(I2C2, OV2640_DEVICE_READ_ADDRESS,
			I2C_Direction_Transmitter);

	/* Test on I2C2 EV6 and clear it */
	timeout = DCMI_TIMEOUT_MAX; /* Initialize timeout value */
	while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED)) {
		/* If the timeout delay is exeeded, exit with error code */
		if ((timeout--) == 0)
			return 0xFF;
	}

	/* Send I2C2 location address LSB */
	I2C_SendData(I2C2, (uint8_t) (Addr));

	/* Test on I2C2 EV8 and clear it */
	timeout = DCMI_TIMEOUT_MAX; /* Initialize timeout value */
	while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_TRANSMITTED)) {
		/* If the timeout delay is exeeded, exit with error code */
		if ((timeout--) == 0)
			return 0xFF;
	}

	/* Clear AF flag if arised */I2C2->SR1 |= (uint16_t) 0x0400;

	/* Generate the Start Condition */
	I2C_GenerateSTART(I2C2, ENABLE);

	/* Test on I2C2 EV6 and clear it */
	timeout = DCMI_TIMEOUT_MAX; /* Initialize timeout value */
	while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_MODE_SELECT)) {
		/* If the timeout delay is exeeded, exit with error code */
		if ((timeout--) == 0)
			return 0xFF;
	}

	/* Send DCMI selcted device slave Address for write */
	I2C_Send7bitAddress(I2C2, OV2640_DEVICE_READ_ADDRESS,
			I2C_Direction_Receiver);

	/* Test on I2C2 EV6 and clear it */
	timeout = DCMI_TIMEOUT_MAX; /* Initialize timeout value */
	while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED)) {
		/* If the timeout delay is exeeded, exit with error code */
		if ((timeout--) == 0)
			return 0xFF;
	}

	/* Prepare an NACK for the next data received */
	I2C_AcknowledgeConfig(I2C2, DISABLE);

	/* Test on I2C2 EV7 and clear it */
	timeout = DCMI_TIMEOUT_MAX; /* Initialize timeout value */
	while (!I2C_CheckEvent(I2C2, I2C_EVENT_MASTER_BYTE_RECEIVED)) {
		/* If the timeout delay is exeeded, exit with error code */
		if ((timeout--) == 0)
			return 0xFF;
	}

	/* Prepare Stop after receiving data */
	I2C_GenerateSTOP(I2C2, ENABLE);

	/* Receive the Data */
	Data = I2C_ReceiveData(I2C2);

	/* return the read data */
	return Data;
}

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
